##### [실습] titanic 승객 데이터 활용

In [28]:
import pandas as pd
import numpy as np

**컬럼 설명** 
- PassengerId - 승객 고유번호
- Survived - 생존유무(target 값) (0 = 사망, 1 = 생존)
- Pclass - 티켓 클래스 (1 = 1st, 2 = 2nd, 3 = 3rd)
- Name - 탑승객 성명
- Sex - 성별 (male: 남성, female: 여성)
- Age - 나이(세)
- SibSp - 함께 탑승한 형제자매, 배우자 수 총합
- Parch - 함께 탑승한 부모, 자녀 수 총합
- Ticket - 티켓 넘버
- Fare - 탑승 요금
- Cabin - 객실 넘버
- Embarked - 탑승 항구 (C: Cherbourg, Q: Queenstown, S: Southampton)

In [29]:
# titanic.csv 파일 로드
# titanic 데이터셋의 메타 데이터 확인
df = pd.read_csv('./data/titanic.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

- 기초문제

In [30]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [31]:
# 1. 전체 승객 중 생존자의 수와 사망자의 수를 구하여 출력
df_0 = df[df['Survived'] == 0]
df_1 = df[df['Survived'] == 1]
print(f'사망자 수 : {df_0.shape[0]}')
print(f'생존자 수 : {df_1.shape[0]}')

사망자 수 : 549
생존자 수 : 342

In [32]:
# 2. 승객 나이의 평균 출력
print(df['Age'].mean())

29.69911764705882

In [53]:
# 3. 1등급 승객 중 운임이 가장 높은 승객의 이름 출력
df_2 = df.sort_values('Fare', ascending=False)
df_2['Name'].head(1)
# df_2.head()

679    Cardeza, Mr. Thomas Drake Martinez
Name: Name, dtype: object

In [34]:
# 4. 여성 승객의 수를 구하여 출력
df[df['Sex'] == 'female'].shape[0]

314

In [57]:
# 5. 운임이 50 이상인 승객의 이름과 운임 출력
df_3 = df[df['Fare'] > 50]
df_3[['Name', 'Fare']]

                                                  Name      Fare
1    Cumings, Mrs. John Bradley (Florence Briggs Th...   71.2833
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)   53.1000
6                              McCarthy, Mr. Timothy J   51.8625
27                      Fortune, Mr. Charles Alexander  263.0000
31      Spencer, Mrs. William Augustus (Marie Eugenie)  146.5208
..                                                 ...       ...
856         Wick, Mrs. George Dennick (Mary Hitchcock)  164.8667
863                  Sage, Miss. Dorothy Edith "Dolly"   69.5500
867               Roebling, Mr. Washington Augustus II   50.4958
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)   52.5542
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)   83.1583

[160 rows x 2 columns]

In [68]:
# 6. 나이가 18세 미만인 승객들의 생존율을 계산하여 출력
df_4 = df[df['Age'] < 18]
df_4_survive = (df_4[df_4['Survived'] == 1].shape[0]/(df_4[df_4['Survived'] == 0].shape[0] + df_4[df_4['Survived'] == 1].shape[0])) * 100
df_4_survive = round(df_4_survive, 2)
print(f'나이가 18세 미만인 승객들의 생존율 : {df_4_survive}%')

나이가 18세 미만인 승객들의 생존율 : 53.98%

In [74]:
# 7. 2등급 객실에 탑승한 승객의 평균 운임을 계산하여 출력
df_5 = df[df['Pclass'] == 2]
print(df_5['Fare'].mean())

20.662183152173913

In [77]:
# 8. 승객 중 나이가 가장 많은 사람의 나이와 이름을 출력
df_6 = df.sort_values('Age', ascending=False)
df_6[['Name', 'Age']].head(1)

                                     Name   Age
630  Barkworth, Mr. Algernon Henry Wilson  80.0

In [81]:
# 9. S 항구에서 탑승한 승객의 수를 출력
df[df['Embarked'] == 'S'].shape[0]

644

In [89]:
# 10. 3등급 객실에 탑승한 남성 승객 중 생존자의 수를 출력
df_7 = df[df['Pclass'] == 3]
df_7[df_7['Survived'] == 1].shape[0]

119

- 고급문제

In [41]:
# 1. 생존자(Survived)와 그렇지 않은 사람들의 `Pclass`(객실 등급)별 평균 나이를 각각 출력

In [42]:
# 2. `SibSp`(형제/배우자 수)가 3 이상인 승객들 중에서, `Fare`(운임) 상위 5명의 이름과 나이를 출력

In [43]:
# 3. 승객 중에서 `Age` 값이 결측치(NaN)인 사람들의 `Embarked`(탑승 항구)별 분포를 출력

In [44]:
# 4. 나이가 16세 미만이고, 혼자 탑승한(`SibSp == 0` and `Parch == 0`) 승객의 이름과 성별, 생존 여부를 출력

In [45]:
# 5. 1등급(Pclass == 1) 객실에 탑승한 승객들 중에서, 운임(Fare)이 평균보다 높은 사람들의 이름과 나이, 운임을 출력

In [46]:
# 6. 나이(Age), 객실 등급(Pclass), 운임(Fare) 값에 결측치가 없는 승객들만 대상으로, 각 등급별 평균 운임과 중앙값 운임을 출력

In [47]:
# 7. 승객들의 `Embarked` 별 평균 나이를 계산하고, 가장 많은 승객이 탑승한 항구를 기준으로 생존율을 계산하여 출력

In [48]:
# 8. 승객 중에서 여성(`Sex == 'female'`)이면서 30세 이상인 사람들의 생존율을 계산하여 출력

In [49]:
# 9. 동반한 형제 또는 배우자 수(`SibSp`)와 부모 또는 자녀 수(`Parch`)의 합이 3 이상인 승객들만을 대상으로, 그들의 생존율을 계산하여 출력

In [50]:
# 10. `Cabin`(객실 번호) 정보가 있는 승객들만을 대상으로, 그들의 생존율을 객실 등급별로 구분하여 계산하여 출력